Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: །གང་གིས་ཀུན་དགའ་ར་བ་དེ་ཉིད་དུ་གཙུག་ལག་ཁང་རྩིག་ཏུ་བཅུག་ན་དེ་བས་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than this is the result of one who has a monastery built in the park.

source: །གང་གིས་གཙུག་ལག་ཁང་དེ་ཉིད་དུ་གནས་མལ་འདི་ལྟ་སྟེ། ཁྲི་དང་། ཁྲིའུ་དང་། སྟན་ནང་ཚངས་ཅན་དང་། ལ་བ་དང་། སྔས་དང་། གོར་བུ་དག་ཕུལ་ན་དེ་བས་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than this is the result of one who provides the monastery with seats and bedding, namely, couches, stools, cushions, blankets, pillows, and square mats.

source: །གང་གིས་གཙུག་ལག་ཁང་དེ་ཉིད་དུ་གཏན་གྱི་རྐྱེན་རིས་བཅད་དེ་རྗེས་སུ་མཐུན་པའི་མཆོད་སྦྱིན་བཙུགས་ན་དེ་བས་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than this is the result of one who frequently makes offerings suitable for conditions in the monastery.

source: །གང་གིས་སངས་རྒྱས་ལ་སྐྱབས་སུ་སོང་ཞིང་ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་སོང་ནས་བསླབ་པའི་གཞི་རྣམས་བླངས་ན། དེ་བས་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than this is the result of one who seeks refuge in the Buddha, the Dharma, and the community and accepts the rules of training.

source: །གང་གིས་བྱམས་པའི་སེམས་དང་ལྡན་པ་ཞེས་བྱ་བ་རྒྱས་པར་སྦྱར་ཏེ། དེ་བས་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: “Greater than this is the result of one who possesses thoughts of love . . . .

source: །རྒྱལ་པོ་ཆེན་པོ་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དུས་དཔོག་གིས་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པ་དེ་ལྟ་བུ་བྱིན་པ་གང་ཡིན་པ་འདི་དང་། གང་གིས་ཕྱི་རོལ་པའི་དྲང་སྲོང་འདོད་པ་རྣམས་ལས་འདོད་ཆགས་དང་བྲལ་བ་བརྒྱ་ཟན་བྱིན་པ་དང་། གང་གིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་བརྒྱ་ཟན་བྱིན་པ་དང་། གང་གིས་རྒྱུན་དུ་ཞུགས་པ་བརྒྱ་དང་། གང་གིས་ལན་གཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་བརྒྱ་དང་། གང་གིས་ལན་གཅིག་ཕྱིར་འོང་བ་བརྒྱ་དང་། གང་གིས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་བརྒྱ་དང་། གང་གིས་ཕྱིར་མི་འོང་བ་བརྒྱ་དང་། གང་གིས་དགྲ་བཅོམ་པའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱ་བའི་ཕྱིར་ཞུགས་པ་བརྒྱ་དང་གང་གིས་དགྲ་བཅོམ་པ་བརྒྱ་དང་། གང་གིས་ཕྱོགས་བཞིའི་དགེ་སློང་གི་དགེ་འདུན་ལ་ཀུན་དགའ་ར་བ་འབུལ་བ་དང་། གང་གིས་ཀུན་དགའ་ར་བ་དེ་ཉིད་དུ་གཙུག་ལག་ཁང་རྩིག་ཏུ་བཅུག་པ་དང་། གང་གིས་གཙུག་ལག་ཁང་དེ་ཉིད་དུ་གནས་མལ་འདི་ལྟ་སྟེ།
en: “Great King, greater than such a donation made to brahmins by the very wealthy brahmin Velāma; one who gives food to one hundred ṛṣis who are non-Buddhist ascetics and free from desires; one who gives food to one hundred people who are going to actualize the fruit of stream-entry; one hundred stream-enterers; one hundred people who are going to actualize the fruit of a once-returner; one hundred once-returners; one hundred people who are going to actualize the fruit of a never-returner; one hundred never-returners;

source: ཁྲི་དང་། ཁྲིའུ་དང་། སྟན་ནང་ཚངས་ཅན་དང་། ལ་བ་དང་། སྔས་དང་། གོར་བུ་དག་འབུལ་བ་དང་། གང་གིས་གཙུག་ལག་ཁང་དེ་ཉིད་དུ་གཏན་གྱི་རྐྱེན་རིས་བཅད་དེ་རྗེས་སུ་མཐུན་པའི་མཆོད་སྦྱིན་འཛུགས་པ་དང་། གང་གིས་སངས་རྒྱས་ལ་སྐྱབས་སུ་འགྲོ།
en: one hundred people who are going to actualize the fruit of an arhat; one hundred arhats; one who offers a park to the community of monks in the four directions; one who has a monastery built in the park; one who provides the monastery with seats and bedding, namely, couches, stools, cushions, blankets, pillows, and square blankets;

source: ཆོས་དང་དགེ་འདུན་ལ་སྐྱབས་སུ་འགྲོ་ཞིང་བསླབ་པའི་གཞི་རྣམས་བླངས་པ་དང་། གང་གིས་བྱམས་པའི་སེམས་དང་ལྡན་པ་ཞེས་བྱ་བ་རྒྱས་པ་བས།
en: one who frequently makes offerings suitable for conditions in the monastery; one who seeks refuge in the Buddha, the Dharma, and the community and accepts the rules of training;

source: གང་ཞིག་འདུ་བྱེད་ཐམས་ཅད་ལ་མི་རྟག་པར་རྗེས་སུ་ལྟ་ཞིང་ཟད་པར་རྗེས་སུ་ལྟ། འདོད་ཆགས་དང་བྲལ་བར་རྗེས་སུ་ལྟ། འགོག་པར་རྗེས་སུ་ལྟ། ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་ཞིང་གནས་ན་སྦྱིན་པ་དེ་བས་འདིའི་འབྲས་བུ་ཆེས་ཆེའོ།
en: and one who possesses thoughts of love . . . is the result of one who observes that all conditioned things are impermanent, who observes exhaustion, who observes freedom from desire, who observes cessation, and who observes emancipation.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟ་བས་ན་ཁྱོད་ཀྱིས་འདི་ལྟར་བསླབ་པར་བྱ་སྟེ།
en: “Great King, therefore you must learn this:

source: འདུ་བྱེད་ཐམས་ཅད་ལ་མི་རྟག་པར་རྗེས་སུ་ལྟ་ཞིང་གནས་པར་བྱའོ།
en: You must observe that all conditioned things are impermanent.

source: །ཟད་པར་རྗེས་སུ་ལྟ་བ་དང་། འདོད་ཆགས་དང་བྲལ་བར་རྗེས་སུ་ལྟ་བ་དང་། འགོག་པར་རྗེས་སུ་ལྟ་བ་དང་། ངེས་པར་འབྱུང་བར་རྗེས་སུ་ལྟ་ཞིང་གནས་པར་བྱའོ་ཞེས་རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་དེ་ལྟར་བསླབ་པར་བྱའོ།
en: You must observe exhaustion, freedom from desire, cessation, and emancipation. Great King, you must learn this.

source: །རྒྱལ་པོ་ཆེན་པོ་དེ་ལྟར་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དུས་དཔོག་དེས་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པ་དག་བཏང་། བསོད་ནམས་དག་བྱས་ནས་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: “Great King, having thus given donations to brahmins and made merit, the very wealthy brahmin Velāma spoke some verses:

source: སྦྱིན་པ་བྱིན་པས་བདེ་བར་འགྱུར།
en: “ ‘One who gives donations will become happy.

source: །སྦྱིན་པ་བྱིན་པས་འཇིགས་པ་མེད།
en: One who gives donations has no fear. He himself is served with donations

source: །ལྷ་དང་མི་ཡི་ནང་དག་ན། །སྦྱིན་པ་ཡིས་ནི་ལེགས་པར་མཆོད།
en: Among gods and humans.

source: །དེ་བས་འབྱོར་པ་འདོད་པ་དང་། །དབང་ཕྱུག་དང་ནི་ལྷ་ཡུལ་དང་། །ཐར་པ་འདོད་པས་རྟག་ཏུ་ནི།
en: “ ‘Therefore one who wishes for prosperity, Kingship, heaven, And liberation always

source: །འཇིགས་པ་མེད་པར་སྦྱིན་པ་གཏང་།
en: Gives donations without fear.’

source: །རྒྱལ་པོ་ཆེན་པོ་དེའི་ཚེ་དེའི་དུས་ན་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དུས་དཔོག་ཅེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་སྙམ་ན་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that the one who was that very wealthy brahmin named Velāma at that time, on that occasion, was someone else, you should think otherwise.

source: དེའི་ཚེ་དེའི་དུས་ན་ང་ཉིད་བྲམ་ཟེ་ཤིང་སཱ་ལ་ཆེན་པོ་ལྟ་བུ་དུས་དཔོག་ཅེས་བྱ་བར་གྱུར་ཏེ། ངས་དེ་ན་བྲམ་ཟེ་རྣམས་ལ་དེ་ལྟ་བུའི་སྦྱིན་པ་བྱིན་ནོ།
en: I was the very wealthy brahmin named Velāma at that time, on that occasion, and there I gave such donations to brahmins.

source: །རྒྱལ་པོ་ཆེན་པོ་ངས་སྦྱིན་པའམ། སྦྱིན་པའི་བགོ་བཤའ་དེས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐོབ་བོ་སྙམ་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟ་སྟེ།
en: “Great King, if you think that I attained supreme and complete awakening by these donations or distributions of donations, you should think otherwise;

source: འོན་ཀྱང་སྦྱིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་རྒྱུ་ཙམ་དང་། རྐྱེན་ཙམ་དང་། ཚོགས་ཙམ་ཡིན་ནོ།
en: these donations were only a cause, only a condition, only a preparation for supreme and complete awakening.” 4. Kuśa a. The Story of Prince Kuśa

source: །རྒྱལ་པོ་ཆེན་པོ་གཞན་ཡང་ངས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་བའི་ཕྱིར་སྦྱིན་པ་དག་བཏང་།
en: “Great King, again, seeking supreme and complete awakening, I gave donations and made merit. Listen to that story.

source: བསོད་ནམས་དག་བྱས་པ་གང་ཡིན་པ་དེ་ཉོན་ཅིག །རྒྱལ་པོ་ཆེན་པོ་སྔོན་བྱུང་བ་རྒྱལ་པོ་ལ་ཉེ་ཅན་ཞེས་བྱ་བ་མཐུ་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱི་སྙིང་དུ་སྡུག་པའི་གྲོགས་པོར་གྱུར་པ་ལས་དེ་ལ་བུ་ཕོ་ཡང་མེད།
en: “Great King, once there was a strong king named Śakuna. He was a good friend of Śakra, Lord of the Gods, but he had no son or daughter.

source: བུ་མོ་ཡང་མེད་ནས་དེ་ལག་པ་ལ་འགྲམ་པ་གཏད་དེ་བདག་གི་འབྱོར་པ་དང་། དབང་ཕྱུག་འདི་འདྲ་ན།
en: He was plunged into grief, resting his cheek on his hand, thinking, ‘Although I have such wealth and sovereignty, I have no son or daughter.

source: བུ་ཕོ་ཡང་མེད་བུ་མོ་ཡང་མེད་པས་བདག་འདས་ན་གདུང་རྒྱུད་འཆད་པར་འགྱུར་རོ་སྙམ་ནས་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་པ་ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་མཐོང་ནས་སྨྲས་པ། གྲོགས་པོ་ཁྱོད་ཅིའི་ཕྱིར་ལག་པ་ལ་འགྲམ་པ་གཏད་ནས་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག །དེས་སྨྲས་པ།
en: After my death, my family lineage will end.’ Śakra, Lord of the Gods, saw him and asked, ‘My friend, why are you plunged into grief, resting your cheek on your hand?’

source: ཀཽ་ཤི་ཀ་བདག་གི་འབྱོར་པ་དང་དབང་ཕྱུག་འདི་འདྲ་ན་བུ་ཕོ་ཡང་མེད་བུ་མོ་ཡང་མེད་པས་བདག་འདས་ན་གདུང་རྒྱུད་འཆད་པར་འགྱུར་རོ།
en: “ ‘Kauśika,’ answered the king, ‘although I have such wealth and sovereignty, I have no son or daughter. After my death, my family lineage will end.’

source: །དེས་སྨྲས་པ། གྲོགས་པོ་ཁོ་བོས་ཁྱོད་ལ་སྨན་ཞིག་བསྐུར་གྱིས་བཙུན་མོ་རྣམས་ལ་ལུད་ཅིག་དང་དེས་ན་ཁྱོད་བུ་ཕོ་དང་བུ་མོ་ཡོད་པར་འགྱུར་རོ།
en: “ ‘My friend, I will send you a certain medicine,’ Śakra said. ‘Give it to your consorts, and you will have sons and daughters.’

source: །ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་རི་སྤོས་ཀྱི་ངད་ལྡང་ལ་སོང་ནས་སྨན་བླངས་ཏེ་རྒྱལ་པོ་དེ་ལ་བསྐུར་བ་དང་། རྒྱལ་པོས་བཙུན་མོ་རྣམས་ལ་སྨན་འདི་འཐུང་ཤིག་ཅེས་བསྐུར་བ་ལས།
en: “Śakra, Lord of the Gods, went to Mount Gandhamādana, found the medicine, and sent it to the king. The king gave it to his consorts, saying, ‘Take this medicine,’ but the king’s chief consort was asleep then.

source: རྒྱལ་པོ་དེའི་བཙུན་མོ་དམ་པ་གཉིད་ཀྱིས་ལོག་པ་དང་། དེ་དག་གིས་དེ་མ་བསླང་བར་སྨན་འཐུངས་པས་དེ་དག་ཐམས་ཅད་སེམས་ཅན་དང་ལྡན་པར་གྱུར་ཏོ།
en: The other women took the medicine, not waking her up, and they all became pregnant.

source: །དེ་ནས་ཕྱི་ཞིག་ན་བཙུན་མོ་དམ་པ་དེ་ལངས་ནས་དེས་དེ་རྣམས་སེམས་ཅན་དང་ལྡན་པར་མཐོང་སྟེ་དེས་སྨྲས་པ།
en: After that, the chief consort woke up and saw them pregnant.

source: ཁྱེད་ཅག་གིས་ཅི་ཞིག་བྱས་ན་དེས་ན་སེམས་ཅན་དང་ལྡན་པར་གྱུར།
en: She asked, ‘What did you do to become pregnant?’

source: དེ་རྣམས་ཀྱིས་སྨྲས་པ། ལྷས་ཁོ་མོ་ཅག་ལ་སྨན་ཞིག་བཏུང་བའི་ཕྱིར་བྱིན་ནོ།
en: “ ‘His Majesty gave us a certain medicine to take,’ they answered.

source: །ཁྱེད་ཅག་གིས་ཅིའི་ཕྱིར་ཁོ་མོ་མི་བསླང་བར་བཏུང་།
en: “ ‘Why did you not wake me up?

source: དེ་ལྟ་མོད་ཀྱི་སྨན་སྣོད་ཅི་ཞིག་ནས་ཁྱེར་ཏེ་འོངས།
en: Anyway, in what vessel was the medicine brought?’

source: ཀུ་ཤའི་ཐུམ་པོར་བཅུག་ནས་སོ།
en: “ ‘It was wrapped in kuśa grass.’

source: །རྩྭ་དེ་གང་ན་འདུག །འོ་ནི་ཡིན་ནོ།
en: “ ‘Where is the grass?’ “ ‘Here.’

source: །དེས་ཀུ་ཤ་བཀྲུས་ནས་འཐུངས་པ་དང་དེ་ཡང་སེམས་ཅན་དང་ལྡན་པར་གྱུར་ཏེ།
en: “She washed the kuśa grass and drank the water, and she became pregnant, too.

source: དེ་རྣམས་ཟླ་བ་བརྒྱད་དམ་དགུ་འདས་པ་དང་དེ་དག་ཐམས་ཅད་ལས་བུས་པ་བཅས་སོ།
en: After eight or nine months, a boy was born to all of them.

source: །དེའི་བཙུན་མོ་དམ་པ་ལས་ནི་བུ་ཕོ་མཚན་ངན་པ་བཅྭ་བརྒྱད་དང་ལྡན་པ་བཞིན་སེང་གེའི་གདོང་ལྟ་བུ་ཚན་པོ་ཆེ་ཆེན་པོའི་ཚན་དང་ལྡན་པ་ཞིག་བཙས་ནས།
en: The chief consort gave birth to a son who had eighteen inauspicious marks, a face like a lion’s, and the power of a great nagna.

source: དེའི་བཙས་སྟོན་རྒྱ་ཆེར་བྱས་ཏེ་ཀུ་ཤ་ཞེས་བྱ་བར་བཏགས་སོ།
en: A great celebration was held at his birth, and he was named Kuśa.

source: །རྒྱལ་པོ་དེ་བུ་གཞན་རྣམས་མཐོང་ན་ནི་དགའ་བར་འགྱུར་ལ། དེ་ནི་མི་སྡུག་པས་ཞེ་སྡང་སྐྱེ་བར་འགྱུར་རོ།
en: The king was pleased when he saw the other sons, but he became angry at Kuśa because the prince’s looks were unpleasant.

source: །ཁམས་ཀྱི་རྒྱལ་ཕྲན་དག་གིས་སྨྲས་པ། ཤེས་ལྡན་དག་བདག་ཅག་ཐམས་ཅད་རྒྱལ་པོ་ལ་ཉེ་ཅན་ཆེན་པོ་འདིས་ཐིབས་ཀྱིས་མནན་གྱིས།
en: “Neighboring minor kings said to each other, ‘Sirs, we are all oppressed by this King Mahāśakuni.

source: དེ་ལ་རྒྱལ་སྲིད་ལས་དབྱུང་གིས་འདོང་ངོ་ཞེས་དེ་རྣམས་དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་དང་འོངས་ནས་དེའི་གྲོང་ཁྱེར་བསྐོར་ཏེ་འདུག་གོ།
en: Let us drive him out of the kingdom.’ They advanced with an army consisting of four divisions and surrounded the king’s city.

source: །རྒྱལ་པོ་ལ་ཉེ་ཅན་ཆེན་པོ་ནི་དེ་རྣམས་དང་ལྷན་ཅིག་གཡུལ་སྤྲོད་མ་ཕོད་ནས་དེ་སྒོ་རྣམས་བཅད་དེ་ར་བའི་ཁ་ནས་སྦྲེངས་ཏེ་འདུག་གོ།
en: Unable to fight them, King Mahāśakuni shut the gates, deployed his army on the walls, and stood there.

source: །ཀུ་ཤ་མའི་དྲུང་དུ་སོང་ནས་སྨྲས་པ། ཡུམ་ཅིའི་སླད་དུ་སྒོ་རྣམས་བཀུམ།
en: “Kuśa went to his mother and asked, ‘Mother, why have the gates been shut?’

source: ཁྱོད་ཀྱི་ཡབ་ཁམས་ཀྱི་རྒྱལ་ཕྲན་དག་དང་ལྷན་ཅིག་གཡུལ་སྤྲོད་མ་ཕོད་ནས་དེས་སྒོ་རྣམས་བཅད་དེ་འདུག་པ་ཡིན་ནོ།
en: “ ‘Your father is unable to fight the neighboring minor kings, and he has shut the gates and stands there.’

source: །ཡུམ་བདག་འདི་དག་དང་ལྷན་ཅིག་གཡུལ་སྤྲད་ཀྱིས་བདག་ལ་རྒྱལ་པོས་ཤིང་རྟ་སྩལ་དུ་གསོལ།
en: “ ‘Mother, I will fight them. The king should give me a chariot.’

source: བུ་ཁྱོད་དེའི་སྙིང་དུ་མི་སྡུག་ཅིང་ཞེ་སྡང་སྐྱེ་བར་འགྱུར་ན།
en: “ ‘My son, you are unloved by him and you anger him.

source: དེ་ཇི་ག་ཁྱོད་ལ་ཤིང་རྟ་སྟེར་ཏམ།
en: Why would he give you a chariot?’

source: ཡུམ་བཞུད་ཅིག །བཞུད་ནས་གཞོན་ནུ་ཀུ་ཤ་འདི་དག་དང་ལྷན་ཅིག་གཡུལ་སྤྲོད་པར་འགྱུར་གྱིས་ཤིང་རྟ་སྩོལ་ཅིག་ཅེས་གསུངས་ཤིག །དེ་སོང་ནས་རྒྱལ་པོ་ལ་སྨྲས་པ།
en: “ ‘Mother, please go to him. Please go and say, “Prince Kuśa will fight them. Please give him a chariot.” ’

source: ལྷ་གཞོན་ནུའི་མཆིད་ནས་བདག་འདི་དག་དང་ལྷན་ཅིག་གཡུལ་སྤྲད་ཀྱིས་ཤིང་རྟ་སྩོལ་ཅིག་ཅེས་མཆིའོ།
en: “She went and said to the king, ‘Your Majesty, the prince says, “I will fight them. Please give me a chariot.” ’

source: །དེས་དེ་ལ་ཤིང་རྟ་བྱིན་པ་དང་། དེ་དོང་པ་གཉིས་ཐོགས་ནས་ཤིང་རྟར་ཞུགས་ཏེ་འབྱུང་བར་བརྩམས་པ་དང་། ལྷ་རྣམས་ཀྱི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་བསམས་པ།
en: “When the king had given him a chariot, the prince mounted it, carrying two quivers of arrows, and departed. Śakra, Lord of the Gods, thought, ‘These neighboring minor kings are strong.

source: ཁམས་ཀྱི་རྒྱལ་ཕྲན་འདི་དག་ནི་མཐུ་དང་ལྡན་པ་ཡིན་ལ་གཞོན་ནུ་ཀུ་ཤ་བསྐལ་པ་བཟང་པོའི་བྱང་ཆུབ་སེམས་དཔའ་འདི་ཉོན་མོངས་པར་འགྱུར་གྱིས།
en: Prince Kuśa, the bodhisattva of this fortunate eon, will experience difficulty.

source: འདིའི་གྲོགས་བྱའོ་སྙམ་ནས་དེས་དེ་ལ་དུང་དང་། འཁོར་ལོ་དང་། བེ་ཅོན་བྱིན་ནས་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་གིས་ཁྱོད་འཚོ་བར་གྱིས་ཤིག །དེ་སྒོ་ཕྱེ་ནས་བྱུང་སྟེ་དེ་ནམ་དུང་འབུད་པ་དེའི་ཚེ་དུང་གི་སྒྲས་དཔུང་རྣམས་སྐྲག་ནས་ཁ་ཅིག་ནི་སྒྲ་དེས་འོན་པར་གྱུར་ཏོ།
en: I will help him.’ “He gave the prince a conch shell, chakra, and club and said, ‘O bodhisattva, you should survive with these.’ “The prince opened the gate and set out. When he blew the conch shell, the army was frightened by the sound.

source: །ཁ་ཅིག་ནི་རྣ་བ་བཀག་ནས་འབྲོས་སོ།
en: Some were deafened by it, and some ran away, covering their ears.

source: །ནམ་འཁོར་ལོའམ་བེ་ཅོན་འཕངས་པ་དེའི་ཚེ་དེ་དག་ས་ལ་འགྱེལ་བར་གྱུར་ཏོ།
en: When he threw the chakra and club, people fell to the ground.

source: །དེས་དམག་གི་ནང་དུ་སོང་ནས་དུང་བུས་པ་ན་དེ་དག་ཐམས་ཅད་ཀྱི་རྣ་བ་རྡོལ་བར་གྱུར་ནས་དེ་རྣམས་ཀྱིས་སྐྱེས་བུ་འདི་ནི་སྲིན་པོ་ཡིན་ནོ།
en: When he went into the middle of the battlefield and blew the conch shell, the eardrums of everyone shattered.

source: །ཞེས་བྱས་ནས་བྲོས་སོ། །དེས་རིལ་ཕབ་ནས་ཕའི་དྲུང་དུ་སོང་སྟེ།
en: They ran away, thinking, ‘This man is a rākṣasa!’ The prince won a complete victory and returned to his father.

source: ལྷ་བདག་གིས་རྒྱལ་པོ་ཐམས་ཅད་ཕམ་པར་བགྱིས་ཏེ།
en: “ ‘Your Majesty, I have subdued all the kings.

source: ཡུལ་བསྒྲུབས་ལགས་སོ།
en: Your land is now perfect.’

source: །རྒྱལ་པོ་ལ་ཉེ་ཅན་ཆེན་པོས་ཐོས་ནས་མགུ་སྟེ་དེས་བསམས་པ།
en: “When he heard this, King Mahāśakuni was delighted.

source: གཞོན་ནུ་ཀུ་ཤ་མཐུ་དང་ལྡན་པ་བརྩོན་འགྲུས་ཕུན་སུམ་ཚོགས་པ་ཡིན་ན་ཅིའི་ཕྱིར་བདག་གིས་འདི་ལ་མི་དགའ་བ་བསྐྱེད་སྙམ་ནས།
en: He said to himself, ‘Prince Kuśa is strong and of perfect vigor. Why did I feel hatred toward him?’

source: དེ་དེ་ལ་དགའ་བ་བསྐྱེད་པར་བརྩམས་སོ།
en: “The king began to feel pleased with the prince.

source: །དེས་བུ་དེ་རྣམས་ཁྱིམ་ཕུབ་ནས་ཀུ་ཤའི་ཆུང་མ་ཡང་བསླང་བར་བརྩམས་པ་དང་། དེ་དག་ཐམས་ཅད་ཀྱིས་སྨྲས་པ།
en: “When he let his sons marry, he tried to find a wife for Kuśa, too.

source: ཀུ་ཤ་མ་གཏོགས་པ་ལ་བུ་མོ་སྦྱིན་ནོ། །རྒྱལ་པོ་གཞན་ཞིག་གིས་རྒྱལ་པོ་གཞན་གྱི་བུ་མོ་ཞིག་བསླངས་ཏེ།
en: But all of those he asked for their daughters said, ‘I would give my daughter to anyone but Kuśa.’ “When a certain king had asked for another king’s daughter, and he had not yet married her, King Mahāśakuni asked for the girl under the pretense of asking for her for another son of his and gave the girl to Kuśa.

source: བག་མར་མ་བླངས་པའི་བར་དེར་རྒྱལ་པོ་ལ་ཉེ་ཅན་ཆེན་པོས་བུ་གཞན་གྱི་ཆེད་ཡིན་པའི་ཐབས་ཤིག་གིས་བསླངས་ནས་བུ་མོ་དེ་ཀུ་ཤ་ལ་བྱིན་ནས་རྒྱུ་སྐར་དང་། ཉི་ཚོད་དང་། ཡུད་ཙམ་དག་བསྟུན་ཏེ་གཞོན་ནུ་ཀུ་ཤའི་ཁྱིམ་ཕུབ་བོ།
en: Investigating constellations and consulting the sundial to choose an auspicious day, time, and moment, he had Prince Kuśa and the girl marry each other.

source: །རྒྱལ་པོས་སྨྲས་པ།
en: The king then issued an order:

source: ཤེས་ལྡན་དག་སུས་ཀྱང་གཞོན་ནུ་ཀུ་ཤ་ལ་མེ་ལོང་མ་བསྟན་ཅིག་ཆུར་འཇུག་པའི་ཁྲུས་མ་ཡིན་པའི་ཁྲུས་ཀྱིས་ཁྲུས་བྱོས་ཤིག །ཉིན་པར་ཆུང་མའི་དྲུང་དུ་མ་གཏོང་ཤིག །གཞོན་ནུ་ཀུ་ཤ་སྤུན་རྣམས་དང་ལྷན་ཅིག་རྩེ་བ་ཆུང་མ་དེས་མཐོང་ནས་དེས་སྨྲས་པ། གཞོན་ནུ་རྣམས་ཀྱི་དབུས་ན་རྩེད་མོ་བྱེད་པའི་ཤ་ཟ་ཕ་བི་སུ་ཞིག་ཡིན་དེ་ནི་ཁྱོད་ཀྱི་ཁྱིམ་ཐབ་ཡིན་ནོ།
en: ‘Sirs, none should show a mirror to Prince Kuśa. Let him wash without entering the water. Do not let him go to his wife in the daytime.’ “When Prince Kuśa was playing with his brothers, his wife saw him and asked some others, ‘Who is that fiend playing among the princes?’ “ ‘It is your husband.’

source: །ཅི་ཁོ་མོའི་ཁྱིམ་ཐབ་འདི་འདྲ་བ་ཞིག་གམ།
en: “ ‘How could my husband be this kind of man?’

source: ཕྱི་ཞིག་ན་ཡང་དེས་གཞོན་ནུ་རྣམས་དང་ལྷན་ཅིག་ཆུ་ན་རྩེ་བའི་བར་དག་མཐོང་ནས།
en: “Later, she again saw him playing with water with the other princes.

source: དེ་བཞིན་དུ་བདག་གི་ཁྱིམ་ཐབ་འདི་འདྲ་བ་ཞིག་སྙམ་སྟེ་དེས་བསམས་པ།
en: Having asked and been answered in the same way, she lamented, ‘My husband is this kind of man!’

source: མངོན་སུམ་དུ་བྱའོ་སྙམ་ནས།
en: “She determined, though, that she would confirm it.

source: དེས་མེ་མར་བུས་ཏེ་ཕྲུ་བས་བཀབ་ནས་བཞག་གོ།
en: She lit a lamp and covered it with a pot.

source: །དེ་ཡང་ཆུང་མའི་དྲུང་དུ་འོངས་པ་དང་། དེས་ཀྱང་བསྟན་པ་ལས་མཚན་ངན་པ་བཅྭ་བརྒྱད་དང་ལྡན་པ་བཞིན་སེང་གེའི་གདོང་འདྲ་བ་ཞིག་མཐོང་ནས་དེས་སྨྲས་པ།
en: When the prince came to his wife, she uncovered the lamp and she saw him, he who had eighteen inauspicious marks and a face like a lion.

source: ཤ་ཟ་ཤ་ཟ་ཞེས་བྱས་ནས་བྲོས་སོ།
en: She ran away, crying, ‘Fiend! Fiend!’

source: །རྒྱལ་པོ་ལ་ཉེ་ཅན་ཆེན་པོ་ལ་རི་འོར་བ་གཞན་ཞིག་ལོག་ནས་དེས་གཞོན་ནུ་ཀུ་ཤ་སོང་ལ་རི་འོར་བ་རྣམས་ཕོབ་ཤིག་ཅེས་བཏང་ནས།
en: “A certain hamlet chief revolted against King Mahāśakuni. The king sent Prince Kuśa there, ordering him, ‘Go and conquer the people of that hamlet.’ When he had gone there, Kuśa’s wife sent a message to her parents:

source: དེ་དེར་སོང་བ་དང་ཀུ་ཤའི་ཆུང་མས་ཕ་དང་མ་ལ་ཁྱེད་ཅག་སའི་སྟེང་ན་སྐྱེས་པ་མེད་དམ་ཅི་ན།
en: ‘Are there any other men in the world?

source: ཁྱེད་ཀྱིས་བདག་ཤ་ཟ་ལ་སྦྱིན།
en: You gave me to a fiend.

source: གལ་ཏེ་བདག་བཀུམ་ན་དེ་ལྟ་ན་ལེགས། གལ་ཏེ་མ་བཀུམ་ན་ནི་ཁོ་མོ་རང་འཆིའོ། །ཞེས་སྤྲིང་བ་དང་། དེ་དག་གིས་དེ་ཁྲིད་དོ།
en: If you kill me, that’s fine. If you do not, I will kill myself.’ They then took her back.

source: །གཞོན་ནུ་ཀུ་ཤས་ཀྱང་རི་འོར་དེ་ཕབ་སྟེ་འོངས་ནས་དེས་མ་ལ་དྲིས་པ། ཡུམ་བདག་གི་མཆིས་འབྲང་དེ་གར་མཆིས།
en: “Having conquered the hamlet chief, Prince Kuśa returned and asked his mother, ‘Mother, where is my wife?’

source: དེས་སྨྲས་པ། ཕ་མས་ཁྲིད་དོ། །ཅིའི་སླད་དུ།
en: “ ‘She was taken back by her parents,’ his mother replied. “ ‘Why?’

source: ཁྱོད་ཤ་ཟ་ཡིན་སྙམ་ནས་སོ།
en: “ ‘She thought you were a fiend.’

source: །ཡུམ་མཆིས་ལ་དེ་དགུག་པར་བགྱིའོ། །དེ་བཞིན་དུ་གྱིས་ཤིག །དེ་དུང་དང་། འཁོར་ལོ་དང་། བེ་ཅོན་ཁྱེར་ཏེ་དེར་སོང་བ་ལས།
en: “ ‘Mother, I will go and take her back.’ “ ‘You should do so.’

source: ཇི་ཙམ་ན་རི་འོར་གཞན་ཞིག་ན་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ། སེང་གེས་འཇིགས་པས་སྒོ་རྣམས་བཅད་དེ་ཕྱོགས་སུ་ལྟ་ཞིང་འཁོད་པ་དང་། གཞོན་ནུ་ཀུ་ཤས་སྨྲས་པ།
en: “He departed, carrying his conch shell, chakra, and club. At that time, in a certain hamlet, many people had shut the gates and were watching in every direction for fear of a lion.

source: ཅིའི་ཕྱིར་དེ་ལྟར་འདུག །སེང་གེའི་འཇིགས་པས་སོ།
en: Prince Kuśa asked them, ‘Why are you doing such a thing?’ “ ‘Because of fear of a lion.’

source: །ཅི་སྟེ་མི་གསོད།
en: “ ‘Why do you not kill it?’

source: མི་ནུས་མོད།
en: “ ‘We cannot.’

source: གལ་ཏེ་བདག་གིས་བསད་ན། བདག་ལ་ཅི་སྦྱིན།
en: “ ‘If I kill it, what will you give me?’

source: དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པའི་ཕྱེད་དོ།
en: “ ‘Half of an army consisting of four divisions.’

source: །གཞོན་ནུ་ཀུ་ཤས་སེང་གེའི་དྲུང་དུ་ཉེ་བར་སོང་ནས་དུང་བུས་པ་དང་དེའི་རྣ་བ་རྡོལ་ཏེ་ཤི་ནས།
en: “When Kuśa approached the lion and blew his conch shell, it died, its eardrums broken.

source: དེས་དེ་ཁྱེར་ཏེ་རི་འོར་དུ་སོང་ནས་ཤེས་ལྡན་དག་སེང་གེ་དེ་ནི་འདི་ཡིན་ནོ།
en: He brought it to the hamlet. “ ‘Sirs, here is the lion.’

source: །དཔུང་གི་ཚོགས་ཡན་ལག་བཞི་པའི་ཕྱེད་ཁྱེར་ཅིག །དེས་སྨྲས་པ།
en: “ ‘Please take half of an army consisting of four divisions.’

source: ཁྱེད་ཅག་ཉིད་ཀྱི་ལག་ཏུ་ཞོག་ལ་སླར་འོངས་ན་བྱིན་ཅིག །དེ་རི་འོར་གང་ན་ཆུང་མ་དེ་ཡོད་པའི་རི་འོར་དེར་སོང་ནས་མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་ཞིག་གི་དྲུང་དུ་ཕྱིན་པ་དང་། དེས་སྨྲས་པ།
en: “ ‘Keep it with you here’ he replied, ‘and give it to me when I come back.’ “He went to the hamlet where his wife was, and went to a garland maker.

source: ཁྱོད་འདྲ་སུ་ཞིག །དེས་སྨྲས་པ།
en: The garland maker asked, ‘Who are you?’

source: མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་གྱི་བུ་ཡིན་ནོ།
en: “ ‘I am the son of a garland maker,’ he answered.

source: །ཁྱོད་ཀྱི་མིང་ཅི་ཡིན། སྤོང་བྱེད་དོ།
en: “ ‘What is your name?’ “ ‘Vuṭaka.’

source: །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བཟོའི་གནས་དང་ལས་ཀྱི་གནས་དེ་དང་དེ་རྣམས་ལ་མཁས་པ་ཡིན་པས་དེས་མེ་ཏོག་ཕྲེང་ལེགས་པར་བརྒྱུས་པ་དང་། མེ་ཏོག་ཕྲེང་རྒྱུད་མཁན་དེས་བུ་མོ་དེ་ལ་མེ་ཏོག་ཕྲེང་བ་དེ་བྱིན་ནོ།
en: “Bodhisattvas are experts in the arts and technical skills. He skillfully made garlands. The garland maker gave the girl, Kuśa’s wife, one of the garlands.

source: །དེས་སྨྲས་པ། འདི་འདྲ་བའི་མེ་ཏོག་ཕྲེང་བ་ནི་ཁྱོད་ཀྱིས་སྔོན་ལན་འགའ་ཡང་མ་བརྒྱུས་ན་འདི་ལ་རྒྱུ་ཅི་ཡོད།
en: ‘You have never made such a garland,’ she remarked. ‘What is the reason for this?’

source: བདག་གི་སློབ་མས་བརྒྱུས་སོ།
en: “ ‘My disciple made it.’

source: །ཁྱོད་ཀྱི་སློབ་མ་དེ་བལྟའོ།
en: “ ‘I must see your disciple.’ “The garland maker took Kuśa there.

source: །དེས་དེ་དེར་ཁྲིད་པ་དང་། དེས་མཐོང་ནས་དེས་བསམས་པ། ཤ་ཟ་འདི་གང་ནས་འོངས་པ་ཞིག་སྙམ་ནས། དེས་ཤ་ཟ་ཤ་ཟ་ཞེས་སྒྲ་ཕྱུང་སྟེ་དེ་བསྐྲད་པ་ལས།
en: She saw him and wondered, ‘Where has this fiend come from?’ She drove him off, crying, ‘Fiend! Fiend!’

source: གཡོས་མཁན་ཞིག་གི་དྲུང་དུ་ཕྱིན་པ་དང་། དེས་སྨྲས་པ། ཁྱོད་སུ་ཞིག །ཁོ་བོ་གཡོས་མཁན་གྱི་བུ་ཡིན་ནོ།
en: “He then went to a cook, and the cook asked, ‘Who are you?’ “ ‘I am the son of a cook.’

source: །ཁྱོད་ཀྱི་མིང་ཅི་ཡིན། སྣོད་དྲི་ཞིམ་ཞེས་བྱའོ།
en: “ ‘What is your name?’ “ ‘Sthālisugandha.’

source: །དེས་བཙོ་བ་དང་། བསྲེག་པ་ལེགས་པར་བྱས་པ་དང་། གཡོས་མཁན་དེས་ཀྱང་བུ་མོ་དེ་ལ་བཙོས་པ་དང་། བསྲེགས་པ་དེ་བསྟབས་སོ།
en: “He skillfully boiled and baked. The cook served the boiled and baked food to the girl.

source: །དེས་སྨྲས་པ། ཀྱེ་ནང་རྗེ་བཙོ་བ་དང་། བསྲེག་པ་ལེགས་ན་སུས་གཡོས།
en: ‘My man,’ she asked, ‘who skillfully boiled and baked this?’

source: བདག་གི་སློབ་མས་གཡོས་སོ།
en: “ ‘My disciple did.’

source: །ཁྱོད་ཀྱི་སློབ་མ་དེ་བལྟའོ་ཞེས་བྱ་བ་ནས་དེ་ནས་ཀྱང་བསྐྲད་དོ་ཞེས་བྱ་བའི་བར་དུ་སྟེ།
en: “ ‘I must see your disciple.’ “. . . Again he was driven off.

source: སྨན་པ་ཞིག་གི་དྲུང་དུ་ཕྱིན་པ་ལས་དེས་སྨྲས་པ་ཁྱོད་སུ་ཞིག །སྨན་པའི་བུ་ཡིན་ནོ།
en: “He then went to a physician, and the physician asked, ‘Who are you?’ “ ‘I am the son of a physician.’

source: །ཁྱོད་ཀྱི་མིང་ཅི་ཡིན།
en: “ ‘What is your name?’ “ ‘Ātreya.’

source: རྒྱུན་ཤེས་ཀྱི་བུ་ཞེས་བྱའོ། །བུ་མོ་དེ་ཀླད་ནད་ཀྱིས་ཐེབས་པར་གྱུར་པ་དང་། སྨན་པས་གསོ་མ་ནུས་ནས་སྨན་པ་སེམས་ཁོང་དུ་ཆུད་ཅིང་འདུག་གོ།
en: “When the girl had a headache, the physician was plunged into grief, being unable to cure her.

source: །དེས་སྨྲས་པ། མཁན་པོ་ཅིའི་ཕྱིར་སེམས་ཁོང་དུ་ཆུད།
en: Kuśa asked him, ‘Master, why are you plunged into grief?’

source: རྒྱལ་པོའི་བུ་མོ་ཀླད་ནད་ཀྱིས་ཐེབས་ན་ཁོ་བོས་གསོ་བར་མ་ནུས་སོ།
en: “ ‘The princess has a headache, but I am not able to cure her.’ “ ‘I will go and cure her.’

source: །བདག་མཆིས་ལ་གསོ་ལགས་སོ་ཞེས་དེ་སོང་བ་དང་། དེས་མཐོང་ནས་དེས་སྨྲས་པ། ཤ་ཟ་འདི་གང་ནས་འོངས་ཡང་བསམས་པ་གལ་ཏེ་འགའ་ཞིག་སྨྲས་ན། སོས་པར་མ་བྱས་ཀྱིས།
en: “He went to her, and when she saw him she thought, ‘Where has this fiend come from?’ Then she thought, ‘If I say something, he will not heal me.

source: གང་གི་ཚེ་བདག་སོས་པར་གྱུར་པ་དེའི་ཚེ་སྨྲའོ་སྙམ་ནས་དེ་སོས་པར་གྱུར་ནས།
en: I will say it when I have been healed.’ When she had been healed, she cried, ‘Fiend!

source: ཤ་ཟ་ཤ་ཟ་ཞེས་སྒྲ་ཕྱུང་སྟེ།
en: Fiend!’ and drove him off.

source: དེས་དེ་བསྐྲད་པ་ལས་བློན་པོ་རྣམས་ཀྱི་དྲུང་དུ་ཕྱིན་པ་དང་། ཁྱོད་སུ་ཞིག་ཁོ་བོ་སྟོང་ཐུབ་བོ།
en: “He went to ministers and they asked him, ‘Who are you?’ “ ‘I am a match for a thousand.’

source: །དེ་རྣམས་ཀྱིས་དེ་དྲུང་དུ་བཞག་གོ།
en: “They hired him.
